export const languages = {
  en: "English",
  fr: "日本語",
};

export const defaultLang = "en";

export const ui = {
  en: {
    "top.hero.lead":
      "人を心の底から深く感動させること、人の心を動かして魂を振るわせるという意味の四字熟語。",
    "top.aboutMe.lead":
      "本業はフロントエンドを中心としたエンジニアです。たまにバックエンドとかデザインにも携わることがあります。ユーザーがどのような人なのか、何につまづいているのかを考えたうえで、UI/UXを提案、エンジニアリングで実現することが好きです。",
  },
  ja: {
    "top.hero.lead":
      "人を心の底から深く感動させること、人の心を動かして魂を振るわせるという意味の四字熟語。",
    "top.aboutMe.lead":
      "本業はフロントエンドを中心としたエンジニアです。たまにバックエンドとかデザインにも携わることがあります。ユーザーがどのような人なのか、何につまづいているのかを考えたうえで、UI/UXを提案、エンジニアリングで実現することが好きです。",
  },
} as const;
